# Importing Pandas

In [1]:
import pandas as pd
import numpy as np

# Series

In [2]:
days = pd.Series(['Monday', 'Tuesday', 'Wednesday'])
print(days)

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [24]:
days_list = np.array(['Monday', 'Tuesday', 'Wednesday'])
numpy_days = pd.Series(days_list)
numpy_days

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [25]:
days = pd.Series(days_list, index=['a','b','c'])
days

a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [26]:
days1 = pd.Series({'a':'Monday','b':'Tuesday','c':'Wednesday'})
days1

a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [28]:
print(days[0])
print(days['c'])

Monday
Wednesday

In [29]:
days[1:]

b      Tuesday
c    Wednesday
dtype: object

# DataFrame

In [30]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [31]:
df_dict = {'Country': ['Ghana','Kenya','Nigeria','Togo'],
           'Capital': ['Accra','Nairobi','Abuja','Lome'],
           'Population': [10000, 8500, 35000, 12000],
           'Age': [60,70,80,75]}

df_list = [['Ghana','Accra',10000,60],
           ['Kenya','Nairobi',8500,70],
           ['Nigeria','Abuja',35000,80],
           ['Togo','Lome',12000,75]]

In [32]:
df = pd.DataFrame(df_dict, index=[2,4,6,8])
df

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [34]:
df1 = pd.DataFrame(df_dict)
df1

   Country  Capital  Population  Age
0    Ghana    Accra       10000   60
1    Kenya  Nairobi        8500   70
2  Nigeria    Abuja       35000   80
3     Togo     Lome       12000   75

In [35]:
df2 = pd.DataFrame(df_list, columns=['Country','Captial','Population','Age'], index=['a','b','c','d'])
df2

   Country  Captial  Population  Age
a    Ghana    Accra       10000   60
b    Kenya  Nairobi        8500   70
c  Nigeria    Abuja       35000   80
d     Togo     Lome       12000   75

In [37]:
#select row in index 3
df2.iloc[3]

Country        Togo
Captial        Lome
Population    12000
Age              75
Name: d, dtype: object

In [38]:
#select row with index 'd'
df2.loc['d']

Country        Togo
Captial        Lome
Population    12000
Age              75
Name: d, dtype: object

In [39]:
df['Capital']

2      Accra
4    Nairobi
6      Abuja
8       Lome
Name: Capital, dtype: object

In [40]:
df['Capital'][1:3]

4    Nairobi
6      Abuja
Name: Capital, dtype: object

In [41]:
df.iat[2,0]

'Nigeria'

In [42]:
df.at[6,'Country']

'Nigeria'

In [45]:
df['Population'].sum()

65500

In [46]:
df.mean()

Population    16375.00
Age              71.25
dtype: float64

In [47]:
df.describe()

         Population        Age
count      4.000000   4.000000
mean   16375.000000  71.250000
std    12499.166639   8.539126
min     8500.000000  60.000000
25%     9625.000000  67.500000
50%    11000.000000  72.500000
75%    17750.000000  76.250000
max    35000.000000  80.000000

# Null DataFrame

In [48]:
df_dict2 = {'Name': ['James','Yemen','Caro',np.nan],
            'Profession': ['Researcher','Artist','Doctor','Writer'],
            'Experience': [12, np.nan, 10, 8],
            'Height': [np.nan, 175, 180, 150]}

In [49]:
new_df = pd.DataFrame(df_dict2)
new_df

    Name  Profession  Experience  Height
0  James  Researcher        12.0     NaN
1  Yemen      Artist         NaN   175.0
2   Caro      Doctor        10.0   180.0
3    NaN      Writer         8.0   150.0

In [54]:
new_df.isnull()

    Name  Profession  Experience  Height
0  False       False       False    True
1  False       False        True   False
2  False       False       False   False
3   True       False       False   False

In [55]:
new_df.isna()

    Name  Profession  Experience  Height
0  False       False       False    True
1  False       False        True   False
2  False       False       False   False
3   True       False       False   False

In [56]:
new_df.dropna()

   Name Profession  Experience  Height
2  Caro     Doctor        10.0   180.0